def sum(a, b):
    if b !=0:
        return a / b
    return ('на ноль делить нельзя')
a = float(input())
b = float(input())
print (sum(a,b))


# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.


